Repository: alex-bleotu/PraiseUp
Catalog: src/locales/*/messages.po
Languages: ro

source: (English)
ro: (Engleză)

source: (Romanian)
ro: (Română)

source: A step at night, Dreams so bright. A heart so bold, Chasing gold.
ro: Un pas în noapte, Vise strălucitoare. O inimă curajoasă, Urmărind aurul.

source: About Us
ro: Despre noi

source: Access lyrics and chords with ease, bringing your worship moments to life.
ro: Accesează cu ușurință versurile și acordurile, aducând la viață momentele tale de închinare.

source: Access to this account has been temporarily disabled due to many failed attempts. Please try again later.
ro: Accesul la acest cont a fost dezactivat temporar din cauza a multor încercări eșuate. Încearcă din nou mai târziu.

source: Account
ro: Cont

source: Account already exists with different credentials.
ro: Există deja un cont cu alte date de conectare.

source: Account details
ro: Detalii cont

source: Account details updated successfully!
ro: Detaliile contului au fost actualizate cu succes!

source: Add songs
ro: Adaugă melodii

source: Add to
ro: Adaugă

source: Add to album
ro: Adaugă la album

source: Add to other album
ro: Adaugă la alt album

source: Album Name
ro: Numele albumului

source: Albums
ro: Albume

source: All your data will be lost.
ro: Toate datele tale vor fi pierdute.

source: Alphabetical
ro: Alfabetic

source: Already have an account?
ro: Ai deja un cont?

source: Are you sure you want to delete this album?
ro: Ești sigur că vrei să ștergi acest album?

source: Are you sure you want to exit guest mode?
ro: Ești sigur că vrei să ieși din modul oaspete?

source: Are you sure you want to leave?
ro: Ești sigur că vrei să pleci?

source: Are you sure you want to remove this album from your library?
ro: Ești sigur că vrei să elimini acest album din biblioteca ta?

source: Cancel
ro: Anulează

source: Change the chords
ro: Schimbă acordurile

source: Check this out on PraiseUp!
ro: Intră aici pe PraiseUp!

source: Chords
ro: Acorduri

source: Chorus
ro: Refren

source: Clear recent searches
ro: Șterge căutările recente

source: Contact Us
ro: Contactează-ne

source: Continue as Guest
ro: Continuă ca oaspete

source: Continue with Google
ro: Continuă cu Google

source: Create
ro: Creează

source: Create album
ro: Creează album

source: Create an account to save your progress and access your data on multiple devices.
ro: Crează un cont pentru a-ți salva progresul și a accesa datele tale de pe mai multe dispozitive.

source: Create one to add songs to it.
ro: Creează unul pentru a adăuga melodii în el.

source: Created in
ro: Creat în

source: Dark
ro: Întunecat

source: Delete
ro: Șterge

source: Delete Account
ro: Șterge contul

source: Delete album
ro: Șterge albumul

source: Deleting your account will lose all your data.
ro: Ștergerea contului tău va duce la pierderea tuturor datelor tale.

source: Edit album
ro: Editează albumul

source: Edit your album
ro: Editează-ți albumul

source: Editable:
ro: Editabil:

source: Email is already in use.
ro: Emailul este deja folosit.

source: Enable chords
ro: Activează acordurile

source: Exit
ro: Ieși

source: Exit Guest Mode
ro: Ieșire din modul oaspete

source: Explore everything PraiseUp has to offer!
ro: Explorează tot ce îți oferă PraiseUp!

source: Favorite albums
ro: Albume favorite

source: Favorite songs
ro: Melodii favorite

source: Forgot your password?
ro: Ți-ai uitat parola?

source: General Settings
ro: Setări generale

source: Get in Touch
ro: Intră în contact

source: Give your album a name
ro: Pune un nume albumului tău

source: glo[F#m][E]ri[D]fy
ro: drep[F#m][E]ta[D]te

source: Guest
ro: Oaspete

source: I took a step into the night, With dreams that glimmered in the light, A path unknown, a heart so bold, Seeking stories yet untold.
ro: Cu vise care străluceau în lumină, Un drum necunoscut, O inimă atât de curajoasă, Căutând povești încă nespuse.

source: If you have any questions or problems with the app or its content, please contact us.
ro: Dacă ai întrebări sau probleme cu aplicația sau conținutul său, te rugăm să ne contactezi.

source: Invalid email or password.
ro: Email sau parolă incorectă.

source: Invite friends
ro: Invită prietenii

source: Join
ro: Alătură-te

source: Join PraiseUp
ro: Alătură-te PraiseUp

source: Join Us
ro: Alătură-te nouă

source: Language
ro: Limbă

source: Let's start building this ablum
ro: Hai să începem să construim acest album

source: Light
ro: Luminos

source: Link Account
ro: Conectează contul

source: Link your account to save your data and access it from any device.
ro: Conectează-ți contul pentru a-ți salva datele și a le accesa de pe orice dispozitiv.

source: Loading the album
ro: Se încarcă albumul

source: Loading the song
ro: Se încarcă melodia

source: Log in
ro: Conectare

source: Log Out
ro: Deconectare

source: Looking for something else?
ro: Cauți altceva?

source: Lyrics
ro: Versuri

source: Make your worship sessions with quick access to slideshows and more.
ro: Transformă sesiunile de închinare cu acces rapid la prezentări și multe altele.

source: Message
ro: Mesaj

source: Message failed to send!
ro: Mesajul nu a putut fi trimis!

source: Message sent successfully!
ro: Mesajul a fost trimis cu succes!

source: More info
ro: Mai multe informații

source: Name is too short!
ro: Numele este prea scurt!

source: Network error. Please try again later.
ro: Eroare de internet. Încearcă din nou mai târziu.

source: New Password
ro: Parolă nouă

source: No more songs
ro: Nu mai sunt melodii

source: No recent searches
ro: Nicio căutare recentă

source: No search result
ro: Niciun rezultat de căutare

source: No song or album matches your search.
ro: Nicio melodie sau album nu se potrivește căutării tale.

source: Old Password
ro: Parolă veche

source: or
ro: sau

source: Organize and share your favorite worship songs with your friends.
ro: Organizează și distribuie melodiile tale preferate de închinare cu prietenii tăi.

source: Original title is
ro: Titlul original este

source: password
ro: parolă

source: Password
ro: Parolă

source: Password is too short.
ro: Parola este prea scurtă.

source: Personal Email
ro: Emailul personal

source: Prepare, Play, Praise
ro: Pregătește, Cântă, Laudă

source: Recent Searches
ro: Căutări recente

source: Reload
ro: Reîncarcă

source: Reload all data
ro: Reîncarcă toate datele

source: Remove
ro: Elimină

source: Remove album
ro: Elimină albumul

source: Remove from this album
ro: Elimină din acest album

source: Reset your password
ro: Resetează-ți parola

source: Save
ro: Salvează

source: Saved in
ro: Salvat în

source: Search
ro: Caută

source: See more options here
ro: Vezi mai multe opțiuni aici

source: Send reset email
ro: Trimite email de resetare

source: Send the message
ro: Trimite mesajul

source: Settings
ro: Setări

source: Share
ro: Distribuie

source: Show sections
ro: Arată secțiunile

source: Sign In
ro: Conectare

source: Slideshow
ro: Prezentare

source: Something went wrong.
ro: Ceva nu a mers bine.

source: Songs
ro: Melodii

source: Start searching for your favorite songs.
ro: Începe să cauți melodiile tale preferate.

source: Suggested for you
ro: Recomandat pentru tine

source: System
ro: Sistem

source: The password has been changed successfully.
ro: Parola a fost schimbată cu succes.

source: The password is incorrect.
ro: Parola este incorectă.

source: The password you entered is incorrect.
ro: Parola pe care ai introdus-o este incorectă.

source: The songs and albums will be reloaded.
ro: Melodiile și albumele vor fi reîncărcate.

source: Theme
ro: Temă

source: There are no songs in this album.
ro: Nu există melodii în acest album.

source: to proceed.
ro: pentru a continua.

source: Type in the email and password you used to create your account.
ro: Introduceți emailul și parola pe care le-ați folosit pentru a vă crea contul.

source: Type in the email you used to create your account.
ro: Introduceți emailul pe care l-ați folosit pentru a vă crea contul.

source: Type in the old password and the new password you want to use.
ro: Introduceți parola veche și noua parolă pe care doriți să o folosiți.

source: Type your
ro: Introduceți

source: Unknown Artist
ro: Artist necunoscut

source: Update details
ro: Actualizează detaliile

source: Update your account details here.
ro: Actualizează-ți detaliile contului aici.

source: Verse
ro: Strofa

source: Version:
ro: Versiune:

source: Watch the video
ro: Vezi videoclipul

source: Worship Made Easy
ro: Închinarea Simplificată

source: You don't have any albums
ro: Nu ai niciun album

source: You've added all the available songs
ro: Ai adăugat toate melodiile disponibile

source: Your library
ro: Biblioteca ta

source: Your Music, His Glory
ro: Muzica Ta, Slava Lui

source: Your Name
ro: Numele tău

source: Zoom level
ro: Nivel de zoom

source: Zoom Level:
ro: Nivel de zoom:
